{"id":155684,"xmlId":"JRebelPlugin","name":"JRebel and XRebel","description":"<p><a href=\"https://www.jrebel.com/\">JRebel</a> is a productivity tool that allows developers to reload code changes instantly.\n  It skips the rebuild, restart, and redeploy cycle common in Java development.\n  JRebel enables developers to get more done in the same amount of time and stay in the flow while coding.\n  JRebel supports a majority of real-world enterprise java stacks and is easy to install into existing development environments.</p>\n  <br>\n  <p><a href=\"https://www.jrebel.com/products/xrebel\">XRebel</a> is a performance tool for Java development which gives developers real time performance insights to help them understand and resolve potential issues faster and earlier, during the development phase.</p>","tags":["Tools integration"],"vendor":"Perforce Software","version":"2022.1.1","notes":"\n    <p>2022.1.1</p>\n    <ul>\n      <li>Feature: added support for IntelliJ IDEA 2021.3.1 and 2021.2.4.</li>\n      <li>Bug fix: fixed an issue invoking varargs methods from the Evaluate Expression dialog while debugging.</li>\n      <li>Bug fix: fixed an issue with IntelliJ IDEA 2017 where the Remote Server Setup would not show correctly.</li>\n    </ul>\n    <p>2022.1.0</p>\n    <ul>\n      <li>Updated embedded JRebel agent to 2022.1.0.</li>\n    </ul>\n    <p>2021.4.2</p>\n    <ul>\n      <li>Feature: added support for IntelliJ IDEA 2021.3.0.</li>\n      <li>Bug fix: fixed an issue where notifications would not close when clicking \"Don't show again\".</li>\n      <li>Bug fix: fixed an issue where the wrong configuration page was opened from the menu.</li>\n    </ul>\n    <p>2021.4.1</p>\n    <ul>\n      <li>Improvement: improved the JRebel Console using the icon to show severity of log messages.</li>\n      <li>Bug fix: fixed an issue with certain Run Configurations not supporting Run/Debug with JRebel.</li>\n    </ul>\n    <p>2021.4.0</p>\n    <ul>\n      <li>Feature: added support for IntelliJ IDEA 2021.2.2.</li>\n      <li>Improvement: improved the Support Ticket dialog to allow external log files to be attached.</li>\n      <li>Bug fix: fixed an issue with JRebel facet properties not persisting correctly.</li>\n    </ul>\n    <p>2021.3.2</p>\n    <ul>\n      <li>Improvement: improved the JRebel Console echoing console entries from the JRebel Agent.</li>\n      <li>Improvement: improved the stability of reloading classes while the IDE is rebuilding projects.</li>\n      <li>Bug fix: fixed an issue where externally added rebel.xml files were not detected.</li>\n    </ul>\n    <p>2021.3.1</p>\n    <ul>\n      <li>Feature: added support for IntelliJ IDEA 2021.2.</li>\n    </ul>\n    <p>2021.3.0</p>\n    <ul>\n      <li>Feature: added support for IntelliJ IDEA 2021.1.3.</li>\n      <li>Improvement: improved the user experience enabling Remote Server support for individual modules.</li>\n      <li>Bug fix: fixed an integration issue with the Gradle plugin and Remote Server support.</li>\n      <li>Bug fix: fixed an integration issue with the Gradle plugin for projects with multiple source sets.</li>\n      <li>Updated embedded JRebel agent to 2021.3.0.</li>\n      <li>Updated embedded XRebel agent to 2021.3.0.</li>\n    </ul>\n    <p>2021.2.2</p>\n    <ul>\n      <li>Updated embedded JRebel agent to 2021.2.2.</li>\n    </ul>\n    <p>2021.2.1</p>\n    <ul>\n      <li>Improvement: automatic enable Remote Server Support for projects, if rebel-remote.xml is detected when project is opened.</li>\n      <li>Bug fix: fixed a startup issue when running with JRebel if JAVA_TOOL_OPTIONS environment variable was present.</li>\n      <li>Bug fix: fixed an issue where project specific paths were not always extended correctly.</li>\n    </ul>\n    <p>2021.2.0</p>\n    <ul>\n      <li>Feature: added support for IntelliJ IDEA 2021.1.</li>\n      <li>Bug fix: fixed an integration issue with the debugger not showing all fields in Variables inspection view.</li>\n    </ul>\n    <p>2021.1.2</p>\n    <ul>\n      <li>Improvement: improved performance when enabling JRebel for Gradle projects.</li>\n      <li>Bug fix: fixed an integration issue with Gradle generating rebel.xml files with relative paths.</li>\n    </ul>\n    <p>2021.1.1</p>\n    <ul>\n      <li>Feature: added support for IntelliJ IDEA 2020.3.2.</li>\n      <li>Bug fix: fixed an integration issue with the debugger that could cause a ClassNotPreparedException when reloading interfaces.</li>\n    </ul>\n    <p>2021.1.0</p>\n    <ul>\n      <li>Bug fix: fixed an integration issue with Gradle that could cause a project reimport on startup.</li>\n    </ul>\n    <p>2020.3.2</p>\n    <ul>\n      <li>Bug fix: fixed a bug where generation of rebel.xml using external build tool could fail.</li>\n      <li>Bug fix: fixed a bug with the debugger integration causing error popups when inspecting variables.</li>\n    </ul>\n    <p>2020.3.1</p>\n    <ul>\n      <li>Bug fix: fixed an integration issue with macOS where some JRebel popup dialogs would not show fully.</li>\n    </ul>\n    <p>2020.3.0</p>\n    <ul>\n      <li>Bug fix: fixed an integration issue with Gradle modules that could cause invalid paths to be used in generated rebel.xml files.</li>\n      <li>Bug fix: fixed an integration issue with Gradle modules where relative path variables could resolve to a wrong path.</li>\n      <li>Bug fix: fixed an integration issue with macOS where the JRebel Enablement dialog would not show fully.</li>\n    </ul>\n    <p>2020.2.5.1</p>\n    <ul>\n      <li>Bug fix: fixed an issue that could cause a deadlock when opening a project.</li>\n    </ul>\n    <p>2020.2.5</p>\n    <ul>\n      <li>Bug fix: fixed an issue on IntelliJ IDEA 2020.2 that caused NoSuchMethodError when editing server run configurations.</li>\n      <li>Bug fix: fixed an issue on IntelliJ IDEA 2020.2 that caused variable inspection in debugger and stepping to hang.</li>\n      <li>Bug fix: fixed an issue with Kotlin plugin that could cause VMMismatchException.</li>\n      <li>Bug fix: fixed an issue where debugger variables view could show wrong types for fields.</li>\n    </ul>\n    <p>2020.2.4.1</p>\n    <ul>\n      <li>Improvement: added notification regarding incompatibility with the Async Debugger enabled in IntelliJ IDEA 2020.2 and a workaround how to disable it.</li>\n    </ul>\n    <p>2020.2.4</p>\n    <ul>\n      <li>Bug fix: fixed an issue on IntelliJ IDEA 2016 that could cause an error message about wrong thread.</li>\n      <li>Bug fix: fixed an issue that accessed disposed resources causing an Already disposed error message.</li>\n      <li>Bug fix: fixed an issue where querying for proxy settings could cause UI freezes.</li>\n    </ul>\n    <p>2020.2.3</p>\n    <ul>\n      <li>Bug fix: fixed a performance issues during module loading that could cause UI freezes.</li>\n    </ul>\n    <p>2020.2.2</p>\n    <ul>\n      <li>Updated embedded JRebel agent to 2020.2.2.</li>\n    </ul>\n    <p>2020.2.1</p>\n    <ul>\n      <li>Bug fix: fixed an integration issue with IntelliJ IDEA causing ClassNotFoundException when generating rebel-remote.xml if the maven plugin was disabled.</li>\n      <li>Bug fix: fixed a bug causing excessive logging of \"Detected changed rebel.xml\" for the same file.</li>\n    </ul>\n    <p>2020.2.0</p>\n    <ul>\n      <li>Feature: added support for IntelliJ IDEA 2020.1.</li>\n      <li>Bug fix: fixed an integration issue where facet and plugin settings would revert to default.</li>\n      <li>Bug fix: fixed an integration issue where the debug launcher would attach an incompatible agent to Liferay servers.</li>\n      <li>Bug fix: fixed an integration issue where the debugger did not break on breakpoints.</li>\n    </ul>\n    <p>2020.1.1</p>\n    <ul>\n      <li>Improvement: updated the name, description, and icon of the plugin to include XRebel as well.</li>\n      <li>Bug fix: fixed an integration issue where automatic path variables were not passed correctly to Run Configurations.</li>\n      <li>Bug fix: fixed an integration issue with the Services tool window where the Run/Debug with Rebel could use the wrong Run Configuration.</li>\n    </ul>\n    <p>2020.1.0</p>\n    <ul>\n      <li>Feature: added XRebel Agent to the plugin distribution and added option to run projects/servers with either or both agents. <a href=\"https://manuals.jrebel.com/jrebel/ide/xrebel-for-intellij.html\">More information</a>.</li>\n      <li>Bug fix: fixed an integration issue with IntelliJ IDEA 2019.3 causing a NullPointerException when importing a multi-module Kotlin Gradle project.</li>\n      <li>Bug fix: fixed an integration issue with IntelliJ IDEA 2019.3 that threw a NoClassDefFoundError if the Maven plugin was disabled.</li>\n      <li>Bug fix: fixed an integration issue with IntelliJ IDEA 2019.3 where the Debug with JRebel button was disabled for Gradle tasks.</li>\n    </ul>\n    <p>2019.2.2</p>\n    <ul>\n      <li>Feature: added support for automatic path variables to expand correctly when launching from command line.</li>\n      <li>Improvement: improved the rebel.xml generation to use relative project path variables.</li>\n      <li>Improvement: improved the Regenerate xml configuration option to regenerate both rebel.xml and rebel-remote.xml.</li>\n    </ul>\n    <p>2019.2.1</p>\n    <ul>\n      <li>Deprecation: removed experimental support for delegating rebel.xml generation to external Gradle build.</li>\n      <li>Bug fix: fixed an integration issue with version 2017 and 2018 where rebel.xml generation would produce incorrect path if Gradle build delegation was enabled.</li>\n    </ul>\n    <p>2019.2.0</p>\n    <ul>\n      <li>Feature: added support to the Remote Server integration to reflect rebel.xml changes immediately.</li>\n      <li>Improvement: improved the rebel-remote.xml generation to use the groupId and artifactId for the module, if present.</li>\n      <li>Improvement: improved the JRebel launch from IDE to disable Class Data Sharing for Java 11, circumventing a JVM bug.</li>\n      <li>Bug fix: fixed an integration issue with IntelliJ IDEA 2019.3 EAP where the JRebel plugin was using a deprecated method marked for removal.</li>\n    </ul>\n    <p>2019.1.6</p>\n    <ul>\n      <li>Bug fix: fixed an integration issue with the debugger where attaching it would incorrectly warn about not working properly.</li>\n    </ul>\n    <p>2019.1.5</p>\n    <ul>\n      <li>Bug fix: fixed an issue that caused the JRebel plugin to not support IDEs running on Java 6.</li>\n      <li>Bug fix: fixed an integration issue with IntelliJ IDEA 2019.2 that caused the IDE to freeze when trying to activate JRebel.</li>\n    </ul>\n    <p>2019.1.4</p>\n    <ul>\n      <li>Improvement: improved the Setup guide to suggest the user to enable automatic compilation.</li>\n    </ul>\n    <p>2019.1.3</p>\n    <ul>\n      <li>Improvement: improved the Setup guide flow by not leading the user to the Quick Start guide on the website.</li>\n      <li>Improvement: improved the debugger integration adding better support for arrays of reloaded types.</li>\n      <li>Improvement: increased the License Server lease duration to four hours.</li>\n      <li>Bug fix: fixed an issue where the Activation dialog would guide users to an incorrect next step.</li>\n    </ul>\n    <p>2019.1.2</p>\n    <ul>\n      <li>Improvement: updated the \"JRebel activated\" notification.</li>\n      <li>Improvement: added tooltip for the Setup Guide reload step.</li>\n      <li>Bug fix: fixed a rebel.xml generation issue with special characters not being properly escaped.</li>\n      <li>Bug fix: fixed an issue when starting a run configuration with Debug with JRebel didn't start up if pre-launch tasks contained \"Run Another Configuration\" step.</li>\n    </ul>\n    <p>2019.1.1</p>\n    <ul>\n      <li>Improvement: improved enabling the automatic compilation to align with new IDE settings as of IntelliJ IDEA 2018.2.0+.</li>\n      <li>Bug fix: fixed an issue where notifications were shown with the JRebel Setup Guide open.</li>\n    </ul>\n    <p>2019.1.0</p>\n    <ul>\n      <li>Improvement: updated activation dialog for ZTLM team evaluation flow.</li>\n      <li>Bug fix: fixed an issue where Net Promoter Score notification was rendered incorrectly on Windows.</li>\n    </ul>\n    <p>2018.2.7</p>\n    <ul>\n      <li>Bug fix: fixed an issue that could cause JRebel notfications show up in wrong project window.</li>\n      <li>Bug fix: fixed an issue with incorrectly escaped space character in the Run instructions.</li>\n      <li>Bug fix: fixed an issue where generating rebel.xml for many modules caused IntelliJ to freeze.</li>\n      <li>Update: updated the EULA.</li>\n    </ul>\n    <p>2018.2.6</p>\n    <ul>\n      <li>Bug fix: fixed an issue where applications did not start in case custom path was targeting missing jrebel.jar.</li>\n      <li>Bug fix: fixed the documentation for running the remote Tomcat as Windows service.</li>\n      <li>Update: updated the trial period length to 10 days.</li>\n    </ul>\n    <p>2018.2.5</p>\n    <ul>\n      <li>Improvement: added warning in case rebel.xml is excluded from a Hybris backoffice build.</li>\n      <li>Bug fix: fixed an issue where the JRebel facet was sometimes added to non-Java modules.</li>\n      <li>Bug fix: fixed an issue where debugger occasionally did not break on breakpoints if the JRebel agent was not attached to the application being debugged.</li>\n    </ul>\n    <p>2018.2.4</p>\n    <ul>\n      <li>Feature: added support for automatic project-specific path variables in rebel.xml.</li>\n      <li>Bug fix: fixed an issue where debug with JRebel was not starting if run configuration contained npm script running step.</li>\n      <li>Bug fix: fixed an issue with occasional deadlocks when enabling remote servers in JRebel options.</li>\n      <li>Bug fix: fixed JRebel plugin state inconsistency when creating/deleting/moving rebel.xml manually.</li>\n      <li>Bug fix: fixed an issue causing incorrect hyphenation in the support form.</li>\n    </ul>\n    <p>2018.2.3</p>\n    <ul>\n      <li>Feature: dedicated dialog to ask for time saved per redeploy is now generally available.</li>\n      <li>Bug fix: fixed an issue where Net Promoter Score notification was rendered incorrectly on high DPI.</li>\n      <li>Bug fix: fixed an issue where debugger did not stop on the breakpoints for Grails process for versions prior to 3.1.5.</li>\n    </ul>\n    <p>2018.2.2</p>\n    <ul>\n      <li>Bug fix: fixed an issue where request made by JRebel failed if the client had an NTLM proxy.</li>\n    </ul>\n    <p>2018.2.1</p>\n    <ul>\n      <li>Bug fix: fix UI freezings when applying changes to rebel.xml generation settings.</li>\n    </ul>\n    <p>2018.2.0</p>\n    <ul>\n      <li>Improvement: added option for permanently hiding the JRebel Setup Guide.</li>\n      <li>Bug fix: don't show the JRebel Setup Guide if there is no Java project in the workspace.</li>\n    </ul>\n    <p>2018.1.7</p>\n    <ul>\n      <li>Feature: IntelliJ/Maven integration for rebel.xml generation is now generally available.</li>\n      <li>Improvement: for license server licensing, email is now requested on IDE startup if it was not previously provided.</li>\n      <li>Improvement: removed support for License Server floating licenses.</li>\n      <li>Bug fix: fixed occasional NullPointerExceptions when opening the JRebel Setup Guide.</li>\n      <li>Bug fix: fixed an issue where JRebel plugin was crashing with IntelliJ Ultimate 14.0.</li>\n    </ul>\n    <p>2018.1.6</p>\n    <ul>\n      <li>Feature: added support for automatic renewal of offline seats.</li>\n      <li>Improvement: added JRebel setup guide. Available as a pilot for randomly selected subset of users.</li>\n    </ul>\n    <p>2018.1.5</p>\n    <ul>\n      <li>Feature: Added the \"Run with JRebel\" and \"Debug with JRebel\" buttons to the Application Servers tool window.</li>\n      <li>Improvement: added feedback messages in UI for external rebel.xml generation.</li>\n      <li>Bug fix: fixed an issue where clicking on Select All in JRebel Panel caused exception messages in the IDE error log.</li>\n    </ul>\n    <p>2018.1.4</p>\n    <ul>\n      <li>Improvement: updated Startup instructions for latest WildFly versions.</li>\n      <li>Improvement: added UI to enable IntelliJ IDEA's automatic build option (pilot completed, enabling for all users).</li>\n      <li>Improvement: requests proxy credentials when proxy authentication is required.</li>\n      <li>Improvement: added shortcut to enable/disable JRebel and remote server support from project's context menu.</li>\n      <li>Improvement: updated the order of licensing options in activation dialog (license server licensing is now topmost).</li>\n      <li>Improvement: direct users to proxy guide when obtaining a license fails due to proxy configuration.</li>\n      <li>Improvement: improved JRebel startup instructions for macOS when path contains spaces.</li>\n    </ul>\n    <p>2018.1.3.1</p>\n    <ul>\n      <li>Bug fix: fixed an issue where disabled Gradle plugin breaks JRebel plugin initialization.</li>\n      <li>Bug fix: fixed a NPE when calling maven project lookup too early.</li>\n    </ul>\n    <p>2018.1.3</p>\n    <ul>\n      <li>Feature: Maven users can now configure JRebel plugin to generate rebel.xml with JRebel Maven plugin.</li>\n      <li>Improvement: JRebel 2018.1.3 dropped support for IntelliJ IDEA version 13.</li>\n      <li>Bug fix: Excessive modules for source sets not filtered out if Gradle option \"Store generated project files externally\" is selected.</li>\n      <li>Bug fix: fixed a MissingFormatArgumentException that caused notifications not to be shown.</li>\n      <li>Bug fix: fixed an issue where Consent radio button state was not updated after activating from JRebel Configuration.</li>\n    </ul>\n    <p>2018.1.2</p>\n    <ul>\n      <li>Bug fix: fixed an issue where proxy authentication fails when different configurations are used for HTTP and HTTPS proxy settings.</li>\n      <li>Bug fix: fixed an issue where proxy authentication fails on Windows with a wrong username.</li>\n    </ul>\n    <p>2018.1.1</p>\n    <ul>\n      <li>Feature: added a dedicated dialog to&nbsp;ask for time saved per redeploy (pilot for subset of users).</li>\n      <li>Feature: added UI to&nbsp;enable IntelliJ IDEA's automatic build (pilot for subset of users).</li>\n      <li>Improvement:&nbsp;removed the forum links from the About widget.</li>\n      <li>Improvement:&nbsp;separated the proxy configuration for licensing as used by JRebel Agent vs IDE.</li>\n      <li>Improvement:&nbsp;updated the Startup tab to include setup instructions for Spring Boot 2.x, Payara 4 and 5 and GlassFish 5.</li>\n      <li>Improvement:&nbsp;updated the Startup tab to better handle white spaces in JRebel paths in code snippets on Linux and macOS.</li>\n      <li>Improvement:&nbsp;generic plugin errors are now visible in jrebel-intellij.log.</li>\n      <li>Improvement:&nbsp;implemented a new rebel.xml lookup algorithm and generation scenarios.</li>\n      <li>Bug fix:&nbsp;updated the changelog link.</li>\n      <li>Bug fix: fixed&nbsp;lease not being updated when first update attempt fails with a soon-to-be-invalid lease.</li>\n      <li>Bug fix:&nbsp;fixed&nbsp;startup problems when using an automatic proxy.</li>\n      <li>Bug fix:&nbsp;JRebel project settings are now kept when disabling/re-enabling JRebel for a project.</li>\n      <li>Bug fix: fixed&nbsp;high DPI problems in the activation dialog.</li>\n      <li>Bug fix: corrected an&nbsp;error that occurred while creating the JRebel context menu.</li>\n      <li>Bug fix:&nbsp;improved UI behavior when the external jrebel.jar is missing.</li>\n      <li>Bug fix: fixed&nbsp;rebel.xml location when Maven integration plugin is disabled.</li>\n    </ul>\n    <p>2018.1.0</p>\n    <ul>\n      <li>Feature: added support for Java 10.</li>\n      <li>Feature: added integration for the new Run Dashboard component.</li>\n      <li>Improvement: removed the Legacy Agent.</li>\n      <li>Improvement: added better proxy support for connecting to the License Server. Best available proxy settings will be used automatically.</li>\n      <li>Improvement: implemented notifications reminding to redeploy the applications after enabling JRebel or remote server support for a project.</li>\n      <li>Improvement: disabled the \"delete missing files from remote server\" setting by default.</li>\n      <li>Improvement: redesigned tabs in project settings.</li>\n      <li>Bug fix: fixed scaling issues in JRebel settings for high DPI screens.</li>\n      <li>Bug fix: fixed an issue where the offline lease would become invalid when user had activated twice.</li>\n      <li>Bug fix: fixed an issue with remote synchronization getting stuck when the request failed for multiple projects and servers.</li>\n      <li>Bug fix: proxy credentials are no longer requested when checking for updates.</li>\n      <li>Bug fix: fixed an issue where adding JRebel facet to a module without facet in project settings would fail.</li>\n      <li>Bug fix: fixed an issue where the activation dialog would show an incorrect state when JRebel is configured with License Server, but is currently without a license.</li>\n      <li>Bug fix: fixed an issue that allowed specifying duplicate remote server URLs.</li>\n    </ul>\n  \n  ","dependencies":["com.intellij.modules.java"],"optionalDependencies":["com.intellij.javaee","WebSphere","Weblogic","org.jetbrains.idea.maven","org.jetbrains.plugins.gradle","com.intellij.javaee.view","com.intellij.javaee.app.servers.integration"],"since":"163.0","size":43798040,"url":"https://www.jrebel.com//"}