{"id":82183,"xmlId":"info.woody.api.intellij.plugin.csct.CodeStyleChecker","name":"Code Style Check Tool","description":"\n      This plugin is used for code style checking. It could report code smells in your source files.\n      If you want to add more customization please contact me, or checkout the <em>CodeStyleChecker</em> project on github.\n      <p>Note: this plugin scans the file content based on the text, but no any AST technologies are used. If some issues\n      were reported inaccurately, please ignore it or leave a comment. Thanks.</p>\n    ","vendor":"Woody","version":"T.3.4","notes":"\n      <p>31.03.2020 - T.3.4 - Fix deprecated API usages;</p>\n      <p>18.11.2019 - T.2.6 - Add tips for Groovy's NPE check; new check rule for unnecessary space chars; new check rule for code similarity;</p>\n      <p>28.09.2019 - *.2.5 - Improve the check accuracy</p>\n      <p>17.09.2019 - *.2.4 - Add checks for unused method parameters, unused local variables and low-performance expressions inside loop statement;</p>\n      <p>09.09.2019 - *.2.3 - Increase the check correctness rate;</p>\n      <p>28.08.2019 - *.2.2 - Add variable definition position check; Add removable variable check; Suppress literal extraction check for enum type;</p>\n      <p>15.08.2019 - *.2.1 - Add complex `if` expression check; Add `tab` char check; Enhance the `access modifier` check;</p>\n      <p>24.11.2018 - *.2.0 - Fix some inaccurate checks; Check the missing or redundant @return and @throws; Check the methods with too many lines; Check the classes with too many methods;</p>\n      <p>19.08.2018 - *.1.9 - Add an editor menu item `Quick Code Style Check`; add action icons; exclude literal extraction for 0.0; enhance enum comparison; all validators should be a subtype of interface Validator; skip check for @see.</p>\n      <p>12.08.2018 - *.1.8 - Split issue report into 3 summary reports: overview, author and file. Add method naming check, should start with a verb; Add comparison check with empty string; Add comparison check with null, Groovy; Add snake case naming check for fields, methods and variables; Optimise method/variable/class detection; Optimise the extraction of author; remove the @since check; Add check for missing parameter documentation.</p>\n      <p>05.08.2018 - 0.1.7 - Update the compatibility to IC-2018.2; optimise some checks; add naming checks for methods and classes.</p>\n      <p>23.07.2018 - 0.1.6 - Run check job in background with a progress indicator. Add name convention check for Spring profile feature.</p>\n      <p>17.07.2018 - 0.1.5 - Fix bugs caused by incorrect configuration. Optimise some check items.</p>\n      <p>24.06.2018 - 0.1.4 - Now resulting report support 2 approaches to view issues: view by author; view by issue type.</p>\n      <p>21.06.2018 - 0.1.3 - Support navigation within editor by line number.</p>\n      <p>20.06.2018 - 0.1.2 - Totally we support 54 code style check items for Java and Groovy.</p>\n      <p>05.06.2018 - 0.1.1 - Initial version for release. Please contact me if any issues.</p>\n      <p><b>`*` means main versions which might be compatible with different main version IntelliJ, such as 181(2018.1.*) and 182(2018.2.*).</b></p>\n    \n    ","dependencies":["com.intellij.modules.java"],"since":"181.0","size":4212415}